#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mazurerm_resource_group.main: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop][0m
[0m[1mazurerm_public_ip.catapp-pip: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/publicIPAddresses/taco-production-ip][0m
[0m[1mazurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/virtualNetworks/taco-production-vnet][0m
[0m[1mazurerm_network_security_group.catapp-sg: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkSecurityGroups/taco-production-sg][0m
[0m[1mazurerm_subnet.subnet: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/virtualNetworks/taco-production-vnet/subnets/taco-production-subnet][0m
[0m[1mazurerm_network_interface.catapp-nic: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkInterfaces/taco-production-catapp-nic][0m
[0m[1mazurerm_network_interface_security_group_association.catapp-nic-sg-ass: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkInterfaces/taco-production-catapp-nic|/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkSecurityGroups/taco-production-sg][0m
[0m[1mazurerm_linux_virtual_machine.catapp: Refreshing state... [id=/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Compute/virtualMachines/taco-production-meow][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # azurerm_linux_virtual_machine.catapp[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_linux_virtual_machine" "catapp" {
      [33m~[0m[0m computer_name                                          = "taco-production-meow" -> (known after apply)
      [33m~[0m[0m custom_data                                            = (sensitive value) [31m# forces replacement[0m[0m
      [32m+[0m[0m disk_controller_type                                   = (known after apply)
      [31m-[0m[0m encryption_at_host_enabled                             = false [90m-> null[0m[0m
      [33m~[0m[0m id                                                     = "/subscriptions/16f1299e-c5d6-4d0a-8c74-35852359c75b/resourceGroups/taco-production-workshop/providers/Microsoft.Compute/virtualMachines/taco-production-meow" -> (known after apply)
        name                                                   = "taco-production-meow"
      [33m~[0m[0m private_ip_address                                     = "10.42.0.4" -> (known after apply)
      [33m~[0m[0m private_ip_addresses                                   = [
          [31m-[0m[0m "10.42.0.4",
        ] -> (known after apply)
      [33m~[0m[0m public_ip_address                                      = "20.185.150.150" -> (known after apply)
      [33m~[0m[0m public_ip_addresses                                    = [
          [31m-[0m[0m "20.185.150.150",
        ] -> (known after apply)
      [31m-[0m[0m secure_boot_enabled                                    = false [90m-> null[0m[0m
      [31m-[0m[0m tags                                                   = {} [90m-> null[0m[0m
      [33m~[0m[0m virtual_machine_id                                     = "2ad114c1-efb1-4078-a9ed-d14bfcb971e3" -> (known after apply)
      [31m-[0m[0m vtpm_enabled                                           = false [90m-> null[0m[0m
        [90m# (30 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m os_disk {
          [33m~[0m[0m name                             = "taco-production-meow_OsDisk_1_a4ef9071d56243d6ada0fea88153e539" -> (known after apply)
            [90m# (7 unchanged attributes hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m```

</details>

*Pusher: @drogerschariot, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Production on PR to Main`*